система_реагирования_на_ЧС/src/Documents/СписаниеРесурсов/СписаниеРесурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеРесурсов</name>
  <registerRecords>AccumulationRegister.ОстаткиРесурсов</registerRecords>
  <tabularSections>
    <name>СписокРесурсов</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.СписокРесурсов</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

система_реагирования_на_ЧС/src/AccumulationRegisters/ОстаткиРесурсов/ОстаткиРесурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиРесурсов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.СписокРесурсов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

система_реагирования_на_ЧС/src/Documents/СписаниеРесурсов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!


	Движения.ОстаткиРесурсов.Записывать = Истина;
	Для Каждого ТекСтрокаСписокРесурсов из СписокРесурсов Цикл
		Движение = Движения.ОстаткиРесурсов.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Ресурс = ТекСтрокаСписокРесурсов.Ресурс;
		Движение.Количество = ТекСтрокаСписокРесурсов.Количество;
	КонецЦикла;
	Движения.Записать();
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОстаткиРесурсовОстатки.Ресурс,
		|	ОстаткиРесурсовОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиРесурсов.Остатки КАК ОстаткиРесурсовОстатки
		|ГДЕ
		|	ОстаткиРесурсовОстатки.КоличествоОстаток < 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Сообщить("мало ресурса " + ВыборкаДетальныеЗаписи.Ресурс + ",не хватает ещё "
			 		 + ( -ВыборкаДетальныеЗаписи.КоличествоОстаток))
		КонецЦикла;
	КонецЕсли;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
КонецПроцедуры
